FGMFoam-Delft/FGMFoam/03_testcase-run/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default            Euler;
}

gradSchemes
{
    default         cellLimited Gauss linear 1;
    grad(U)	    cellLimited Gauss linear 1;
}

divSchemes
{
    default          none;
    div(phi,U)       Gauss linearUpwindV grad(U);
    div(phi,k)       Gauss upwind;
    div(phi,epsilon)      Gauss upwind;
    div((nuEff*dev(T(grad(U))))) Gauss linear;  
    //added for FGMFoam:
    div(phi,Z)       Gauss upwind;
    div(phi,PV)      Gauss upwind;
    div(phi,K)       Gauss  upwind;
    div(phi,Yi_h)    Gauss limitedLinear 1;
    div(phi,nuTilda) Gauss limitedLinear 1;
    div((muEff*dev2(T(grad(U))))) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phid,p)      Gauss limitedLinear 1; 
}

laplacianSchemes
{
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited1;
}

fluxRequired
{
    default         no;
    p;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
